Revit 2025 API
Toposolid.GetSubDivisionIds Method
 Get all element ids of toposolid subdivisions with the current toposolid as its host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public IList<ElementId> GetSubDivisionIds()
Public Function GetSubDivisionIds As IList(Of ElementId)
public:
IList<ElementId^>^ GetSubDivisionIds()
member GetSubDivisionIds : unit -> IList<ElementId>
Return Value
IList<ElementId>
 The array of toposolid subdivision ids.
See Also
Reference
Toposolid Class
Autodesk.Revit.DB Namespace